================================================================================
Comments
================================================================================

// This is a comment
/* This is a 
multiline comment */

--------------------------------------------------------------------------------

(comment)
(comment)

================================================================================
Function definition
================================================================================

function getFooByBar(bar) {
  // This is a comment
}

--------------------------------------------------------------------------------

(program
      (function_declaration
        (identifier)
        (parameters
          (identifier))
        (block
          (comment))))

================================================================================
Function calls
================================================================================

$myFunction()
$myFunction(foo)
$myFunction($foo)
$myFunction(bar, baz=wheee)

--------------------------------------------------------------------------------

(source_file
    (expression_statement
      (function_call
        (variable
          (identifier))
        (arguments)))
    (expression_statement
      (function_call
        (variable
          (identifier))
        (arguments
          (argument
            (string
              (identifier))))))
    (expression_statement
      (function_call
        (variable
          (identifier))
        (arguments
          (argument
            (variable
              (identifier))))))
    (expression_statement
      (function_call
        (variable
          (identifier))
        (arguments
          (argument
            (string
              (identifier)))
          (argument
            (keyword_argument
              (identifier)
              (identifier)))))))

================================================================================
String literals
================================================================================

$a = "0"
$b = '123'
$c = '''abc
def'''
$d = `Hello {world}`

--------------------------------------------------------------------------------

(comment)
(comment)
